Revit 2027 API
StructuralConnectionHandler.GetOrigin Method
 Retrieves origin point of Structural Connection Handler element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetOrigin()
Public Function GetOrigin As XYZ
public:
XYZ^ GetOrigin()
member GetOrigin : unit -> XYZ
Return Value
XYZ
 The origin point of element.
See Also
Reference
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace